In [1]:
import numpy as np 
import pandas as pd 
pd.read_excel('dataset/data.csv.xlsx',header=None,nrows=5)

          0      1         2         3
0  Duration  Pulse  Maxpulse  Calories
1        60    110       130     409.1
2        60    117       145       479
3        60    103       135       340
4        45    109       175     282.4

In [ ]:

data = pd.DataFrame({'name':['Jane','John','Ashley','Mike','Emily','Jack','Catlin'],
'ctg':['A','A','C','B','B','C','B'],
'val':np.random.random(7).round(2),
'val2':np.random.randint(1,10, size=7)})
print(data.to_string)

In [ ]:
#values in 'val' > 0.5
print(data[data['val']>0.5])

In [6]:
#filter name jane
print(data[data['name']=='Jane'])

   name ctg   val  val2
0  Jane   A  0.15     6

In [12]:
#multiple filter
print(data[(data['val']>0.5) & (data['val2']==1)])
print(data[(data['val']<0.5) | (data['val2']==7)])

    name ctg   val  val2
1   John   A  0.77     1
4  Emily   B  0.72     1
     name ctg   val  val2
0    Jane   A  0.15     6
2  Ashley   C  0.48     1
6  Catlin   B  0.47     3

In [22]:
name = ['John','Catlin','Mike']
data[data.name.isin(name)]

     name ctg   val  val2
1    John   A  0.77     1
3    Mike   B  0.60     3
6  Catlin   B  0.47     3

In [23]:
data[data.name.str.startswith('J')]

   name ctg   val  val2
0  Jane   A  0.15     6
1  John   A  0.77     1
5  Jack   C  0.98     3

In [26]:
data[data.name.str.contains('y')]

     name ctg   val  val2
2  Ashley   C  0.48     1
4   Emily   B  0.72     1

In [29]:
data[~data.name.str.startswith('J')]

     name ctg   val  val2
2  Ashley   C  0.48     1
3    Mike   B  0.60     3
4   Emily   B  0.72     1
6  Catlin   B  0.47     3

In [33]:
data.query("ctg == 'A' and val > 0.5")

   name ctg   val  val2
1  John   A  0.77     1

In [36]:
print(data.nlargest(3, 'val'),'\n')
print(data.nsmallest(2, 'val2'))

    name ctg   val  val2
5   Jack   C  0.98     3
1   John   A  0.77     1
4  Emily   B  0.72     1

     name ctg   val  val2
1    John   A  0.77     1
2  Ashley   C  0.48     1

In [38]:
#loc and iloc are used to select rows and columns by label or integer position
data.iloc[2:3,:]

     name ctg   val  val2
2  Ashley   C  0.48     1

In [39]:
data.index = ['a','b','c','d','e','f','g']
print(data.to_string())

     name ctg   val  val2
a    Jane   A  0.15     6
b    John   A  0.77     1
c  Ashley   C  0.48     1
d    Mike   B  0.60     3
e   Emily   B  0.72     1
f    Jack   C  0.98     3
g  Catlin   B  0.47     3

In [40]:
data.loc['b':'d', :]

     name ctg   val  val2
b    John   A  0.77     1
c  Ashley   C  0.48     1
d    Mike   B  0.60     3

In [45]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 
'New Delhi', 'Brasilia'], 'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data,columns=['Country', 'Capital', 'Population'])
data

{'Country': ['Belgium', 'India', 'Brazil'],
 'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [61]:
s['a']
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528